//
// Created by 12547 on 2021/9/5.
//
#include "LinkListImpl.h"
void Union(LinkList A, LinkList B) {
    LNode *pa = A->next, *pb = B->next, *pc = A;
    LNode *p;
    while(pa != NULL && pb != NULL) {
        if (pa->data == pb->data) {
            pc->next = pa;
            pc = pa;
            pa = pa->next;
            p = pb;
            pb = pb->next;
            free(p);
        } else if (pa->data < pb->data) {
            p = pa;
            pa = pa->next;
            free(p);
        } else {
            p = pb;
            pb = pb->next;
            free(p);
        }
    }

    while (pa != NULL) {
        p = pa;
        pa = pa->next;
        free(p);
    }

    while (pb != NULL) {
        p = pb;
        pb = pb->next;
        free(p);
    }

    pc->next = NULL;//这一点很重要，如果没有这一句，比如下面这这样两个链表
//    int a[7] = {2, 4, 4, 5, 10, 10, 24};
//    int b[5] = {1, 4, 6, 10, 23};
//    如果不设置最后等于NULL的话，链表A中，10这个结点之后用的是free清除掉的后面的指针内容，但是注意
//    free只是把这个指针指向的存储位置的数据清除了，[10]->next依然指向的是这个被清除过的位置，所以最后会造成无限指向下一个的情况
//    Head->4->10->11277472->11277568->11277408->11272528->11277664->11300320->11277472->11277568->11277408->11272528->1127766
//    4->11300320->11277472->11277568->11277408->11272528->11277664->11300320->11277472->11277568->11277408->11272528->1127766
//    4->11300320->11277472->11277568->11277408->11272528->11277664->11300320->11277472->11277568->11277408->11272528->1127766
//    4->11300320->11277472->11277568->11277408->11272528->11277664->11300320->11277472->11277568->11277408->11272528->1127766
//    4->11300320->11277472->11277568->11277408->11272528->11277664->11300320->11277472->11277568->11277408->11272528->1127766
//    4->11300320->11277472->11277568->11277408->11272528->11277664->11300320->11277472->11277568->11277408->11272528->1127766
//    4->11300320->11277472->11277568->11277408->11272528->11277664->11300320->11277472->11277568->11277408->11272528->1127766
//    4->11300320->11277472->11277568->11277408->11272528->11277664->11300320->11277472->11277568->11277408->11272528->1127766...
//    所以要人为地为最后一位的next指针设置指向NULL
    free(pb);
}

int main() {
    int a[7] = {2, 4, 4, 5, 10, 10, 24};
    int b[5] = {1, 4, 6, 10, 23};
    LinkList L1;
    LinkList L2;
    L1 = CreateListWithHead(a, 7);
    L2 = CreateListWithHead(b, 5);
    Union(L1, L2);
    printListWithHead(L1);
}